# 1. В первый день спортсмен пробежал `x` километров, а затем он каждый день увеличивал пробег на 10%
# от предыдущего значения. По данному числу `y` определите номер дня, на который пробег спортсмена составит
# не менее `y` километров.
#
# Программа получает на вход числа `x` и `y` и должна вывести одно число - номер дня.
#

runner = float(input('Введие x = '))
runner_up = float(input('Введите y = '))
number_day = 0
while runner < runner_up:
    runner *= 1.1
    number_day += 1
    # print(runner)
print('Номер дня', number_day, 'в который бегун пробежит ', runner_up, 'км')
