# 7. ** Написать программу "Показать звезды".
# На вход принимает обычное целое число, должно напечатать количество звезд:
#
#    Пример:
#    Input number of stars: 8
#     ********
#
number = int(input('Введите целое число = '))
print(number * "*")
