# 6. *доп.задание
# Шахматный конь ходит буквой “Г” — на две клетки по вертикали в любом направлении
# и на одну клетку по горизонтали, или наоборот.
# Даны две различные клетки шахматной доски, определите, может ли конь попасть с первой клетки на вторую одним ходом.
vert = list(range(1, 9))
print(vert)
gor = list(range(a, h))
print(gor)
